In [1]:
import pandas as pd

In [2]:
# Soru 1: persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.
df=pd.read_csv('persona.csv')

In [3]:
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [5]:
def x(data):
    print('######### shape #########')
    print(data.shape)
    print('########### ndim ##########')
    print(data.ndim)
    print('########## tail ###########')
    print(data.tail(10))
    print('########### describe ############')
    print(data.describe().T)
    print('############# isnull.sum##########')
    print(data.isnull().sum())

x(df)

######### shape #########
(5000, 5)
########### ndim ##########
2
########## tail ###########
      PRICE   SOURCE     SEX COUNTRY  AGE
4990     39      ios    male     usa   27
4991     29      ios    male     usa   27
4992     19      ios    male     usa   27
4993     39      ios    male     usa   27
4994     39  android  female     bra   31
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
########### describe ############
        count     mean        std   min   25%   50%   75%   max
PRICE  5000.0  34.1320  12.464897   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  17.0  21.0  27.0  66.0
############# isnull.sum##########
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64

In [6]:
df.columns

Index(['PRICE', 'SOURCE', 'SEX', 'COUNTRY', 'AGE'], dtype='object')

In [8]:
df.describe()

             PRICE          AGE
count  5000.000000  5000.000000
mean     34.132000    23.581400
std      12.464897     8.995908
min       9.000000    15.000000
25%      29.000000    17.000000
50%      39.000000    21.000000
75%      39.000000    27.000000
max      59.000000    66.000000

In [10]:
df.isnull().values.any()

False

In [12]:
df.duplicated().sum()

3616

In [15]:
df.dtypes

PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [12]:
# Soru 2: Kaç unique SOURCE vardır? 
df['SOURCE'].unique()

array(['android', 'ios'], dtype=object)

In [21]:
# Frekansları nedir?
df['SOURCE'].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [7]:
def data(data1):
    print(data1['SOURCE'].unique())
    print(data1['SOURCE'].value_counts())
    
data(df)

['android' 'ios']
SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [13]:
# Soru 3: Kaç unique PRICE vardır?
df['PRICE'].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [19]:
# Soru 4: Hangi PRICE'dan kaçar tane satış gerçekleşmiş?
df['PRICE'].value_counts()

PRICE
29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: count, dtype: int64

In [20]:
# Soru 5: Hangi ülkeden kaçar tane satış olmuş?
df['COUNTRY'].value_counts()

COUNTRY
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: count, dtype: int64

In [24]:
#  Soru 6: Ülkelere göre satışlardan toplam ne kadar kazanılmış?
df.groupby('COUNTRY').agg({'PRICE':'sum'})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [26]:
# Soru 7: SOURCE türlerine göre satış sayıları nedir?
df.groupby('COUNTRY').agg({'SOURCE':'count'})

         SOURCE
COUNTRY
bra        1496
can         230
deu         455
fra         303
tur         451
usa        2065

In [27]:
# Soru 8: Ülkelere göre PRICE ortalamaları nedir?
df.groupby('COUNTRY').agg({'PRICE':'mean'})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

In [28]:
# Soru 9: SOURCE'lara göre PRICE ortalamaları nedir?
df.groupby('SOURCE').agg({'PRICE':'mean'})

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [ ]:
# PRICE – Müşterinin harcama tutarı
Değişkenler
SOURCE – Müşterinin bağlandığı cihaz türü
SEX – Müşterinin cinsiyeti
COUNTRY – Müşterinin ülkesi
AGE – Müşterinin yaşı

In [30]:
# Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?
df.groupby(['COUNTRY','SOURCE']).agg({'PRICE':'mean'})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

In [31]:
# Görev 2: COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?
df.groupby(['COUNTRY','SOURCE','SEX','AGE']).agg({'PRICE':'mean'})

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

In [5]:
# Görev 3: Çıktıyı PRICE’a göre sıralayınız.
agg_df=df.groupby(['COUNTRY','SOURCE','SEX','AGE']).agg({'PRICE':'mean'}).sort_values('PRICE',ascending=False)

In [6]:
# Görev 4: Indekste yer alan isimleri değişken ismine çeviriniz.
agg_df=agg_df.reset_index()

In [8]:
# Görev 5: Age değişkenini kategorik değişkene çeviriniz ve agg_df’e ekleyiniz.

agg_df["AGE_CAT"] = pd.cut(x=agg_df['AGE'],
                           bins=[0,12,18,35,55,70],
                           labels=['0-12','13-18','19-35','36-55','56-up'])

In [9]:
# Görev 6: Yeni seviye tabanlı müşterileri (persona) tanımlayınız.
agg_df['CUSTOMERS_LEVEL_BASED'] = agg_df['COUNTRY'].astype(str) + "_" + \
                                  agg_df['SOURCE'].astype(str) + "_" + \
                                  agg_df['SEX'].astype(str) + "_" + \
                                  agg_df['AGE_CAT'].astype(str)

In [10]:
agg_df_grby = agg_df.groupby('CUSTOMERS_LEVEL_BASED').agg({"PRICE":'mean'})

In [11]:
agg_df_grby

                              PRICE
CUSTOMERS_LEVEL_BASED
bra_android_female_13-18  35.645303
bra_android_female_19-35  33.702125
bra_android_female_36-55  36.873519
bra_android_female_56-up  37.000000
bra_android_male_13-18    34.805861
...                             ...
usa_ios_female_56-up      38.250000
usa_ios_male_13-18        33.983495
usa_ios_male_19-35        36.586569
usa_ios_male_36-55        31.329545
usa_ios_male_56-up        46.500000

[76 rows x 1 columns]